---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGExportAvailable
source: html/ffbcdc6e-d0d1-598f-0ce3-1eb9b53bb7d2.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGExportAvailable Method

Checks whether the DWG Export functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDWGExportAvailable()
```

## Returns
True if the DWG Export functionality is available in the installed Revit.

## Remarks
DWG Export requires presence of certain modules that are optional and may not be part of the installed Revit.